[
  
    {
      "quote": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
      "author": "Qur’an 3:139"
    }
    ,
  
    {
      "quote": "O Allah, I seek refuge in You from grief and sadness, from weakness and laziness, from miserliness and cowardice, from being overcome by debt and overpowered by others.",
      "author": "Hadith"
    }
    ,
  
    {
      "quote": "If you are grateful, I will surely increase you [in favor]; but if you deny, indeed, My punishment is severe.",
      "author": "Qur’an 14:7"
    }
    ,
  
    {
      "quote": "The strong believer is more beloved to Allah than the weak believer, but there is goodness in both. Be eager for what benefits you, seek help from Allah, and do not be frustrated...",
      "author": "Sahih Muslim 2664"
    }
    ,
  
    {
      "quote": "If one of you were to carry a bundle of firewood on his back and sell it, that would be better than asking a man who may or may not give him something.",
      "author": "Sunan an-Nasa’i 2584"
    }
    ,
  
    {
      "quote": "All of you are shepherds, and each of you is responsible for his flock.",
      "author": "Sahih al-Bukhari 5200"
    }
    ,
  
    {
      "quote": "Everything in which there is no remembrance of Allah is idle play, except four things: a man playing with his wife; a man training his horse; a man running between two lines; and a man learning how to swim.",
      "author": "An-Nasa’i (As-Sunan Al-Kubra 8889), authenticated by Al-Albani"
    }
    ,
  
    {
      "quote": "And make ready against them all you can of power, including steeds of war...",
      "author": "Qur’an 8:60"
    }
    ,
  
    {
      "quote": "The son of Adam does not fill any vessel worse than his stomach. It is enough for him to eat a few mouthfuls to keep him going...",
      "author": "At-Tirmidhi 2380"
    }
    ,
  
    {
      "quote": "Your body has rights over you.",
      "author": "Sahih al-Bukhari 1839"
    }
    ,
  
    {
      "quote": "The Prophet walked swiftly, as if descending from a high place... we found it difficult to keep pace with him even at his normal speed.",
      "author": "Tirmidhi (Hadith of Ali and Abu Huraira)"
    }
    ,
  
    {
      "quote": "O Allah, bless my Ummah in their early hours of the morning.",
      "author": "Sunan Ibn Majah 2236"
    }
    ,
  
    {
      "quote": "Indeed, Allah would never change a people’s state until they change their own state.",
      "author": "Qur’an 13:11"
    }
    ,
  
    {
      "quote": "Eat of the good things which We have provided for you.",
      "author": "Qur’an 2:172"
    }
    ,
  
    {
      "quote": "O mankind, eat of that which is lawful and good on the earth and do not follow the footsteps of Satan.",
      "author": "Qur’an 2:168"
    }
    ,
  
    {
      "quote": "Keep your burps away from us, for the one who eats his fill the most in this world will be hungry for the longest time on the Day of Resurrection.",
      "author": "Al-Tabarani – Saheeh"
    }
    ,
  
    {
      "quote": "Seek Allah&#39;s help with patient perseverance and prayer. It is indeed hard except for those who are humble.",
      "author": "Qur’an 2:45"
    }
    ,
  
    {
      "quote": "Oh you who believe! Persevere in patience and constancy. Vie in such perseverance, strengthen each other, and be pious, that you may prosper.",
      "author": "Qur’an 3:200"
    }
    ,
  
    {
      "quote": "The strongest man is the one who controls his anger when mistreated.",
      "author": "Al-Bazzaar, authenticated by Ibn Hajr (Fath al-Bari 10/519)"
    }
    ,
  
    {
      "quote": "The best century is my century, then the one after it, then the one after it...",
      "author": "Sahih al-Bukhari – Virtues of the Companions"
    }
    ,
  
    {
      "quote": "There are two blessings that many people are deceived into losing: health and free time.",
      "author": "Sahih al-Bukhari 6412"
    }
    ,
  
    {
      "quote": "By time, indeed mankind is in loss, except for those who have believed and done righteous deeds, and advised each other to truth and patience.",
      "author": "Qur’an 103:1-3"
    }
    ,
  
    {
      "quote": "Seek the reward of the Hereafter by means of what Allah has granted you, without forgetting your share of this world.",
      "author": "Qur’an 28:77"
    }
    ,
  
    {
      "quote": "So once you have fulfilled your duty, strive in devotion.",
      "author": "Qur’an 94:7"
    }
    ,
  
    {
      "quote": "The most complete of believers in faith are those with the best character and who are most kind to their families.",
      "author": "Sunan al-Tirmidhi 2612"
    }
    ,
  
    {
      "quote": "The merciful will be shown mercy by the Most Merciful. Be merciful to those on the earth and the One in the heavens will have mercy upon you.",
      "author": "Sunan al-Tirmidhi 1924"
    }
    ,
  
    {
      "quote": "The believer does not insult others, does not curse others, is not vulgar, and is not shameless.",
      "author": "Sunan al-Tirmidhi 1977"
    }
    ,
  
    {
      "quote": "Be humble towards one another, so that no one oppresses or boasts to another.",
      "author": "Sahih Muslim 2865"
    }
    ,
  
    {
      "quote": "No one with even a seed of arrogance in his heart will enter Paradise. Arrogance means rejecting the truth and looking down on people.",
      "author": "Sahih Muslim 91"
    }
    ,
  
    {
      "quote": "Every good deed is charity. Verily, it is a good deed to meet your brother with a cheerful face.",
      "author": "Sunan al-Tirmidhi 1970"
    }
    ,
  
    {
      "quote": "The upper hand is better than the lower hand. The upper hand gives; the lower takes.",
      "author": "Sahih al-Bukhari 1429"
    }
    ,
  
    {
      "quote": "There is no gift that is better and more comprehensive than patience.",
      "author": "Sahih al-Bukhari 6470"
    }
    ,
  
    {
      "quote": "He has not thanked Allah who has not thanked people.",
      "author": "Sunan Abi Dawud 4811"
    }
    ,
  
    {
      "quote": "The strong are not the best wrestlers. The strong are those who control themselves when angry.",
      "author": "Sahih al-Bukhari 6114"
    }
    ,
  
    {
      "quote": "A servant does not cover the faults of another servant in the world but that Allah will cover his faults on the Day of Resurrection.",
      "author": "Sahih Muslim 2590"
    }
    ,
  
    {
      "quote": "Seeking knowledge is an obligation upon every Muslim.",
      "author": "Sunan Ibn Majah 224"
    }
    ,
  
    {
      "quote": "Calmness is from Allah, and recklessness is from Satan.",
      "author": "Al-Sunan al-Kubra 20270"
    }
    ,
  
    {
      "quote": "Nothing is heavier on the believer’s scale on the Day of Judgment than good character.",
      "author": "Sunan al-Tirmidhi"
    }
    ,
  
    {
      "quote": "He is not one of us who does not show mercy to our young ones and respect to our elders.",
      "author": "Sunan al-Tirmidhi"
    }
    ,
  
    {
      "quote": "Whoever believes in Allah and the Last Day, let him be kind to his neighbor.",
      "author": "Sahih al-Bukhari"
    }
    ,
  
    {
      "quote": "The just will be seated upon pulpits of light on the Day of Judgment.",
      "author": "Sahih Muslim"
    }
    ,
  
    {
      "quote": "The best of affairs are those which are moderate.",
      "author": "Sunan Ibn Majah"
    }
    ,
  
    {
      "quote": "Whoever humbles himself for Allah, Allah will raise him.",
      "author": "Sahih Muslim"
    }
    ,
  
    {
      "quote": "Truthfulness leads to righteousness, and righteousness leads to Paradise.",
      "author": "Sahih al-Bukhari"
    }
    ,
  
    {
      "quote": "And do good; indeed, Allah loves the doers of good.",
      "author": "Qur’an 2:195"
    }
    ,
  
    {
      "quote": "Indeed, Allah commands you to uphold justice and to be kind.",
      "author": "Qur’an 16:90"
    }
    ,
  
    {
      "quote": "And cooperate in righteousness and piety, but do not cooperate in sin and aggression.",
      "author": "Qur’an 5:2"
    }
    ,
  
    {
      "quote": "And your Lord has decreed that you not worship except Him, and to parents, good treatment.",
      "author": "Qur’an 17:23"
    }
    ,
  
    {
      "quote": "If you are grateful, I will surely increase you [in favor].",
      "author": "Qur’an 14:7"
    }
    ,
  
    {
      "quote": "Whoever takes a path in search of knowledge, Allah will cause him to walk in one of the paths to Paradise. Indeed the angels will lower their wings in great pleasure with the one who seeks knowledge.",
      "author": "Sunan Abi Dawud"
    }
    ,
  
    {
      "quote": "Allah will raise those who believe among you and those who were given knowledge, by many degrees. And Allah is All-Aware of what you do.",
      "author": "Qur’an 58:11"
    }
    ,
  
    {
      "quote": "If Allah intends goodness for a person, He gives him the understanding of the religion.",
      "author": "Sahih al-Bukhari"
    }
    ,
  
    {
      "quote": "It is those of His servants who have knowledge who stand in true awe of Allah. Indeed Allah is almighty, most forgiving.",
      "author": "Qur’an 35:28"
    }
    ,
  
    {
      "quote": "Seeking knowledge is a duty upon every Muslim (and Muslimah).",
      "author": "Sunan Ibn Majah"
    }
    ,
  
    {
      "quote": "He has subjected all that is in the heavens and the earth for your benefit, as a gift from Him. There truly are signs in this for those who reflect.",
      "author": "Qur’an 45:13"
    }
    ,
  
    {
      "quote": "Say, ‘Can those who know be equal to those who do not know?’",
      "author": "Qur’an 39:9"
    }
    
  
]